[
  {
    "id": 1,
    "topic": "Cudzí ľudia",
    "title": "Neznámy ujo s darčekom",
    "image": "/images/scenarios/scenaario_01_balloon.webp",
    "text": "Sofia a Olívia sa hrajú na ihrisku. Príde k nim milý ujo, usmeje sa a podáva im krásny modrý balón. Hovorí, že má v aute ešte viac balónov a dokonca aj malé šteniatko. Čo by mali dievčatá urobiť?",
    "options": [
      {
        "text": "Zoberú si balón a idú s ujom k autu.",
        "isCorrect": false,
        "feedback": "Nikdy nechoďte s cudzím človekom k autu, aj keby bol veľmi milý a sľuboval darčeky alebo šteniatka. Cudzí ľudia môžu klamať, aby vás odlákali do bezpečia. Vždy utekajte preč a povedzte to dospelému, ktorému veríte."
      },
      {
        "text": "Povedia 'Nie', rýchlo odídu a povedia to rodičom.",
        "isCorrect": true,
        "feedback": "Výborne! Toto je najbezpečnejšia reakcia. Povedať jasné 'NIE', okamžite sa vzdialiť od cudzieho človeka a nájsť bezpečného dospelého (rodiča, učiteľa) je presne to, čo treba urobiť."
      }
    ]
  },
  {
    "id": 2,
    "topic": "Cudzí ľudia",
    "title": "Ujo, ktorý hľadá cestu",
    "image": "/images/scenarios/scenario_02_map.webp",
    "text": "Sofia a Olívia sú pred domom na chodníku. Zastaví pri nich auto, pán stiahne okienko a hovorí, že sa stratil. Ukazuje im papier s mapou a prosí ich, aby podišli bližšie k autu a ukázali mu, kde je táto ulica. Čo by mali dievčatá urobiť?",
    "options": [
      {
        "text": "Pristúpia k oknu auta a skúsia mu pomôcť nájsť ulicu.",
        "isCorrect": false,
        "feedback": "Pozor! Dospelý človek by nikdy nemal pýtať pomoc od dieťaťa. Ak niekto v aute potrebuje poradiť cestu, musí sa opýtať iného dospelého. Nikdy nechoďte k oknu cudzieho auta!"
      },
      {
        "text": "Odstúpia ďalej od auta a povedia, že musia zavolať rodičov.",
        "isCorrect": true,
        "feedback": "Výborne! Najbezpečnejšie je udržať si odstup od auta. Ak dospelý niečo chce, dievčatá by mali okamžite vyhľadať svojich rodičov alebo iného dospelého, ktorého poznajú."
      }
    ]
  },
  {
    "id": 3,
    "topic": "Stratenie sa",
    "title": "Sama v nákupnom centre",
    "image": "/images/scenarios/scenario_03_mall.webp",
    "text": "Sofia je s mamou vo veľkom obchode. Zaujme ju výklad s hračkami a na chvíľu sa pustí maminej ruky. Keď sa otočí, mama tam nie je. Sofia je stratená v dave cudzích ľudí. Čo by mala urobiť?",
    "options": [
      {
        "text": "Začne behať po celom obchode a hľadať mamu.",
        "isCorrect": false,
        "feedback": "Ak začneš behať, môžeš sa stratiť ešte viac a pre mamu bude ťažšie ťa nájsť. Najlepšie je zostať na mieste, kde si naposledy videla mamu, alebo vyhľadať pomoc."
      },
      {
        "text": "Nájde predavačku v obchode alebo strážnika a povie im, že sa stratila.",
        "isCorrect": true,
        "feedback": "Správne! Ak sa stratíš v obchode, vyhľadaj 'bezpečného dospelého' - najlepšie niekoho ako predavačku, SBS, policajata. Pomôžu ti nájsť rodičov."
      }
    ]
  },
  {
    "id": 4,
    "topic": "Zvieratká",
    "title": "Stratený psík",
    "image": "/images/scenarios/scenario_04_dog.webp",
    "text": "Sofia a Olívia uvidia v parku krásneho psíka s huňatým chvostom. Behá úplne sám a vyzerá veľmi smutne. Olívia ho chce ísť hneď pohladkať a vziať si ho domov. Čo by mali dievčatá urobiť?",
    "options": [
      {
        "text": "Hneď k nemu utekajú a začnú ho hladkať, aby mu nebolo smutno.",
        "isCorrect": false,
        "feedback": "Pozor! Aj ten najmilší psík sa môže zľaknúť cudzieho človeka a v strachu ťa pohrýzť. Nikdy nesiahaj na psíka bez majiteľa."
      },
      {
        "text": "Psíka sa nedotýkajú a idú nájsť dospelého, ktorého poznajú, aby mu o psíkovi povedali.",
        "isCorrect": true,
        "feedback": "Správne! Ak uvidíš psíka samého, najbezpečnejšie je nedotýkať sa ho a zavolať pomoc dospelého, ktorý zistí, komu psík patrí."
      }
    ]
  },
  {
    "id": 5,
    "topic": "Bezpečnosť domova",
    "title": "Niekto zvoní pri dverách",
    "image": "/images/scenarios/scenario_05_door.webp",
    "text": "Sofia a Olívia sú samy v izbe a zrazu niekto zazvoní. Ujo v uniforme za dverami hovorí: 'Mám pre mamku balík, otvor mi, prosím, nech ti ho môžem podať.' Čo by mali urobiť?",
    "options": [
      {
        "text": "Otvoria dvere a balík od uja prevezmú, aby pomohli mamke.",
        "isCorrect": false,
        "feedback": "Nikdy neotváraj dvere nikomu, koho nepoznáš, aj keď má uniformu alebo ti nesie darček. Je to nebezpečné."
      },
      {
        "text": "Dvere neotvoria a cez zatvorené dvere povedia, aby ujo nechal balík pred dverami alebo prišiel neskôr.",
        "isCorrect": true,
        "feedback": "Správne! Dvere musia zostať zamknuté. Bezpečný dospelý pochopí, že dieťa nemôže otvárať a balík nechá u susedov alebo pred dverami."
      }
    ]
  },
  {
    "id": 6,
    "topic": "Bezpečnosť doma",
    "title": "Farebné guľôčky",
    "image": "/images/scenarios/scenario_06_pills.webp",
    "text": "Sofia nájde na stole v kuchyni otvorenú krabičku s farebnými guľôčkami. Vyzerajú presne ako jej obľúbené cukríky a má na ne veľkú chuť. Čo by mala urobiť?",
    "options": [
      {
        "text": "Ochutná jednu guľôčku, aby zistila, či je to naozaj cukrík.",
        "isCorrect": false,
        "feedback": "Pozor! Nikdy nejedz nič, čo nájdeš v krabičke alebo fľaštičke, aj keď to vyzerá ako sladkosť. Môžu to byť lieky, z ktorých by ťa veľmi bolel bruško."
      },
      {
        "text": "Nič si nevezme a ide sa opýtať dospelého, čo je v tej krabičke.",
        "isCorrect": true,
        "feedback": "Správne! Len dospelý vie, čo je v krabičke bezpečné. Vždy sa radšej opýtaj, než niečo ochutnáš."
      }
    ]
  },
  {
    "id": 7,
    "topic": "Bezpečnosť vonku",
    "title": "Nález v pieskovisku",
    "image": "/images/scenarios/scenario_07_sandbox.webp",
    "text": "Sofia a Olívia sa hrajú v pieskovisku a stavajú hrad. Zrazu Sofia v piesku uvidí niečo ostré a lesklé, čo tam niekto nechal. Vyzerá to ako zaujímavá hračka. Čo by mala Sofia urobiť?",
    "options": [
      {
        "text": "Vezme predmet do ruky a ukáže ho Olívii, aby zistili, čo to je.",
        "isCorrect": false,
        "feedback": "Pozor! Na ostré alebo neznáme veci (ako striekačky či črepy zo skla) nikdy nesiahaj. Môžeš sa pichnúť a ochorieť."
      },
      {
        "text": "Vôbec sa toho nedotýka a hneď zavolá dospelého, ktorý je s nimi na ihrisku.",
        "isCorrect": true,
        "feedback": "Správne! Ak nájdeš niečo ostré alebo divné, nikdy na to nesiahaj. Povedz to dospelému, on to bezpečne uprace."
      }
    ]
  },
  {
    "id": 8,
    "topic": "Bezpečnosť vonku",
    "title": "Neznáma teta v parku",
    "image": "/images/scenarios/scenario_08_password.webp",
    "text": "Olívia sa na chvíľu vzdialila od mamky v parku. Príde k nej neznáma teta a hovorí: 'Ahoj Olívia, tvoja mamka ma poslala, aby som ťa vzala za ňou k autu. Poď so mnou!' Čo by mala Olívia urobiť?",
    "options": [
      {
        "text": "Uverí tete a pôjde s ňou k autu, aby bola čo najskôr pri mamke.",
        "isCorrect": false,
        "feedback": "Pozor! Nikdy neodchádzaj s niekým, koho nepoznáš, aj keď povie, že ho poslala mamka. Cudzia osoba ťa nikdy nesmie nikam brať."
      },
      {
        "text": "S tetou nikam nejde, zostane na mieste a začne hlasno kričať na mamičku.",
        "isCorrect": true,
        "feedback": "Správne! S cudzím človekom nikdy nikam nechoď, aj keď pôsobí milo. Najlepšie je zostať tam, kde si, a poriadne nahlas volať o pomoc."
      }
    ]
  },
  {
    "id": 9,
    "topic": "Moje pocity",
    "title": "Nepríjemné šeptanie",
    "image": "/images/scenarios/scenario_09_secret.webp",
    "text": "Niekto cudzí príde k Olívii a pošepká jej do uška niečo, z čoho sa Olívia začne cítiť smutne a trošku sa bojí. Ten človek povie: 'Nikomu to neprezraď, je to naše tajomstvo.' Čo by mala Olívia urobiť?",
    "options": [
      {
        "text": "Nič nikomu nepovie, pretože sľúbila, že to bude tajomstvo.",
        "isCorrect": false,
        "feedback": "Pozor! Ak ti niekto povie niečo, z čoho si smutný/á alebo sa bojíš, nie je to dobré tajomstvo. Takéto veci sa nesmú tajiť."
      },
      {
        "text": "Hneď povie mamičke alebo ockovi, že jej niekto povedal niečo smutné.",
        "isCorrect": true,
        "feedback": "Správne! Ak máš z niečoho zlý pocit v brušku, vždy to povedz dospelému, ktorému veríš. Mamka a ocko ti vždy pomôžu."
      }
    ]
  },
  {
    "id": 10,
    "topic": "Pomoc druhým",
    "title": "Kamarátka v úzkych",
    "image": "/images/scenarios/scenario_10_help.webp",
    "text": "Sofia a Olívia sa hrajú na preliezke. Olívia sa zrazu pošmykne, nevie zliezť dolu a začne sa báť. Sofia je pri nej, ale nevie ju sama bezpečne chytiť. Čo by mala Sofia urobiť?",
    "options": [
      {
        "text": "Snaží sa Olíviu nasilu potiahnuť dolu sama, aj keď je to vysoko.",
        "isCorrect": false,
        "feedback": "Pozor! Ak by si ju ťahala sama, mohli by ste spadnúť obe. Vždy je lepšie zavolať niekoho silnejšieho."
      },
      {
        "text": "Zostane pri Olívii, upokojuje ju a nahlas volá dospelého, aby im pomohol.",
        "isCorrect": true,
        "feedback": "Správne! Najlepšia pomoc je zavolať dospelého. Tým, že si pri kamarátke a voláš o pomoc, si skutočná hrdinka."
      }
    ]
  },
  {
    "id": 11,
    "topic": "Moje súkromie",
    "title": "Nechcené objatie",
    "image": "/images/scenarios/scenario_11_hug.webp",
    "text": "Sused, ktorého Sofia stretáva na chodbe, jej povie: 'Ahoj Sofia, ty si ale vyrástla! Poď mi dať veľkú pusu a objať ma!' Sofia sa však pri tom necíti dobre a nechce sa túliť. Čo by mala urobiť?",
    "options": [
      {
        "text": "Objíme ho a dá mu pusu, aby nebol sused smutný a aby bola slušná.",
        "isCorrect": false,
        "feedback": "Pozor! Nemusíš nikoho objímať len preto, aby si bol/a slušná. Tvoje telo patrí tebe a máš právo povedať 'nie', ak sa ti to nepáči."
      },
      {
        "text": "Povie 'nie, ďakujem', odstúpi a ide hneď k mamičke alebo ockovi.",
        "isCorrect": true,
        "feedback": "Správne! Ak ti je nejaký kontakt nepríjemný, môžeš ho odmietnuť, aj keď je to známy človek. Vždy počúvaj svoj pocit."
      }
    ]
  },
  {
    "id": 12,
    "topic": "Bezpečnosť pri vode",
    "title": "Lopta v bazéne",
    "image": "/images/scenarios/scenario_12_water.webp",
    "text": "Olívia uvidí v plaveckom bazéne svoju obľúbenú nafukovaciu loptu. Pláva kúsok od kraja a Olívia si myslí, že na ňu dočiahne, ak sa poriadne nakloní. Nikto dospelý ju práve nevidí. Čo by mala Olívia urobiť?",
    "options": [
      {
        "text": "Skúsi sa po loptu opatrne natiahnuť z kraja bazéna, aby ju vytiahla sama.",
        "isCorrect": false,
        "feedback": "Pozor! Okolo bazéna býva podlaha mokrá a šmykľavá. Mohla by si do hlbokej vody spadnúť. Nikdy sa nenakláňaj nad bazén, keď si sama."
      },
      {
        "text": "K bazénu vôbec nejde a uteká zavolať dospelého, aby mu o lopte povedala.",
        "isCorrect": true,
        "feedback": "Správne! Pri bazéne musíš byť vždy s dospelým. Bezpečnosť je dôležitejšia než hračka vo vode. Počkaj na mamku alebo ocka."
      }
    ]
  },
  {
    "id": 13,
    "topic": "Bezpečnosť na ceste",
    "title": "Zatúlaná lopta",
    "image": "/images/scenarios/scenario_13_road.webp",
    "text": "Sofia a Olívia sa hrajú s novou loptou blízko chodníka. Zrazu im lopta odskočí a skotúľa sa priamo na rušnú cestu, po ktorej jazdia autá. Lopta leží v strede cesty a dievčatám je to veľmi ľúto. Čo by mali urobiť?",
    "options": [
      {
        "text": "Rýchlo sa rozbehnúť na cestu a loptu zobrať, kým nejde žiadne auto.",
        "isCorrect": false,
        "feedback": "Pozor! Cesta nie je ihrisko. Aj keď sa zdá, že auto práve nejde, môže sa objaviť veľmi rýchlo. Žiadna hračka nestojí za to, aby si sa zranil/a."
      },
      {
        "text": "Zostať stáť v bezpečí na chodníku a poprosiť o pomoc dospelého.",
        "isCorrect": true,
        "feedback": "Výborne! Správne rozhodnutie. Pre hračku na cestu nikdy nesmieš vybehnúť. Dospelý vie, ako bezpečne loptu zobrať, alebo ti radšej kúpi novú."
      }
    ]
  },
  {
    "id": 14,
    "topic": "Nebezpečné predmety",
    "title": "Zapaľovač na stole",
    "image": "/images/scenarios/scenario_14_lighter.webp",
    "text": "Olívia je doma a na stole v obývačke uvidí položený malý lesklý zapaľovač, ktorý tam zabudol niekto dospelý. Má peknú farbu a zaujímavé tlačidlo. Vyskúšať, či sa objaví malý plamienok, vyzerá ako veľká zábava. Čo by mala urobiť?",
    "options": [
      {
        "text": "Skúsiť len raz stlačiť tlačidlo, aby videla, ako funguje, a hneď ho zhasnúť.",
        "isCorrect": false,
        "feedback": "Pozor! Oheň nie je hračka. Plameň zo zapaľovača je horúci a môže okamžite niečo zapáliť. Deti sa so zapaľovačmi nikdy nesmú hrať."
      },
      {
        "text": "Zapaľovača sa vôbec nedotýkať, nechať ho na stole a okamžite zavolať dospelého.",
        "isCorrect": true,
        "feedback": "Správne! Zapaľovače patria len do rúk dospelým. Výborne, že si to neskúšala sama a hneď si zavolala pomoc."
      }
    ]
  },
  {
    "id": 15,
    "topic": "Bezpečnosť doma",
    "title": "Farebné kapsule",
    "image": "/images/scenarios/scenario_15_laundry.webp",
    "text": "Sofia a Olívia sa hrajú na schovávačku a schovajú sa do kúpeľne. Na zemi pri práčke nájdu otvorenú krabičku s farebnými gélovými kapsulami na pranie. Vyzerajú presne ako veľké, mäkké a voňavé želé cukríky. Čo by mali urobiť?",
    "options": [
      {
        "text": "Opatrne zobrať jednu kapsulu, zblízka ju ovoňať a trošku z nej ochutnať, či je to naozaj sladkosť.",
        "isCorrect": false,
        "feedback": "Pozor! Kapsule do prania sú plné nebezpečných chemikálií. Aj keď voňajú a vyzerajú krásne, môžu ti veľmi ublížiť. Nikdy nič z kúpeľne nedávaj do úst!"
      },
      {
        "text": "Vôbec sa ich nedotýkať, nechať ich na zemi a ísť povedať rodičom, že krabička je otvorená.",
        "isCorrect": true,
        "feedback": "Výborne! Správne ste uhádli, že to nie sú cukríky. Čistiace prostriedky chytajú len dospelí, keď idú prať oblečenie."
      }
    ]
  },
  {
    "id": 16,
    "topic": "Bezpečnosť v kuchyni",
    "title": "Horúci hrniec",
    "image": "/images/scenarios/scenario_16_stove.webp",
    "text": "Sofia je v kuchyni a cíti, že sa tam varí niečo voňavé. Na sporáku stojí veľký hrniec, z ktorého sa parí, a jeho dlhá rúčka trčí smerom do priestoru. Sofia je veľmi zvedavá, čo sa varí, ale dobre tam nedočiahne. Čo by mala urobiť?",
    "options": [
      {
        "text": "Postaviť sa na špičky, chytiť hrniec za rúčku a pritiahnuť si ho bližšie, aby nakukla dnu.",
        "isCorrect": false,
        "feedback": "Pozor! Toto je veľmi nebezpečné. Hrniec je horúci a je v ňom vriace jedlo. Keby si ho na seba prevrhla, mohla by si sa vážne popáliť. Sporáka sa nikdy nedotýkaj."
      },
      {
        "text": "Odstúpiť ďalej od sporáka a zavolať dospelého, aby jej bezpečne ukázal, čo sa varí.",
        "isCorrect": true,
        "feedback": "Výborne! Správne vieš, že k horúcemu sporáku a hrncom chodia len dospelí. Dobre, že si neriskovala popálenie a zavolala si pomoc."
      }
    ]
  },
  {
    "id": 17,
    "topic": "Bezpečnosť doma",
    "title": "Otvorené okno",
    "image": "/images/scenarios/scenario_17_window.webp",
    "text": "Sofia a Olívia sa hrajú v izbe. Okno je dokorán otvorené, aby dnu išiel čerstvý vzduch. Zrazu z vonku začujú veľmi zaujímavý zvuk, akoby hrala hudba alebo išiel sprievod. Chceli by vidieť, čo sa tam deje, ale cez vysoký parapet dobre nevidia. Čo by mali urobiť?",
    "options": [
      {
        "text": "Prisunúť si k oknu stoličku alebo krabicu, postaviť sa na ňu a spoločne sa vykloniť, aby lepšie videli.",
        "isCorrect": false,
        "feedback": "Pozor! Toto je obrovské nebezpečenstvo. Z otvoreného okna alebo balkóna sa nikdy nesmiete vykláňať. Mohli by ste stratiť rovnováhu a spadnúť dole."
      },
      {
        "text": "Zostať bezpečne v izbe na zemi a zavolať rodičov, aby ich k oknu zobrali na ruky.",
        "isCorrect": true,
        "feedback": "Správne! K otvorenému oknu sa nikdy nepribližujeme tak blízko, aby sme z neho mohli vypadnúť. Výborne, že ste zavolali dospelého."
      }
    ]
  }
]